In [12]:
from flask import Flask
from flask_sqlalchemy import SQLAlchemy
# from flask_migrate import Migrate

class Config(object):
    SQLALCHEMY_DATABASE_URI = "sqlite:///../resources/nhanes.db"
    SQLALCHEMY_TRACK_MODIFICATIONS = False

app=Flask(__name__)    
app.config.from_object(Config)
db=SQLAlchemy(app)
import models_first_import as m

In [40]:
import csv


with open("../resources/final_df.csv", "r") as file:
    reader=csv.reader(file)
    header=next(reader)
    for line in reader:
        dict={}
        for column,value in zip(header,line):
            try:
                dict[column]=float(value)
            except:
                pass
        newLine=m.main_table(**dict)
#         db.session.add(newLine)

In [37]:
newLine.age_in_years_at_screening

2.0

In [58]:

# Created a variable to hold the name for the primary key of each table:
primary_key_name = 'id'

# # Created a dictionary to reference each table that is related to each survey's main results table; paired the codes
# # with their respective labels:
# data_release_cycle_table = {primary_key_name: [5, 10], 
#                             'cycle': ['NHANES 2007-2008 public release',
#                                       'NHANES 2017-2018 public release']}

six_month_time_period_table = {primary_key_name: [1, 2],
                               'description': ['November 1 through April 30',
                                          'May 1 through October 31']}

gender_table = {primary_key_name: [1, 2],
                'description': ['Male',
                           'Female']}

age_groups_table = {primary_key_name: [1, 2, 3, 4],
                    'description': ['Children/Adolescents (0-19 years)',
                                  'Young adults (20-39 years)',
                                  'Middle age adults (40-59 years)',
                                  'Older adults (60+)']}

race_ethnic_origin_table = {primary_key_name: [*range(1,8)],
                            'description': ['Mexican American',
                                          'Other Hispanic',
                                          'Non-Hispanic White',
                                          'Non-Hispanic Black',
                                          'Other Race-Including Non-Hispanic Asian',
                                          'Non-Hispanic Asian',
                                          'Other Race']}

served_in_the_us_armed_forces_table = {primary_key_name: [1, 2, 777777, 999999],
                                   'description': ['Yes',
                                                    'No',
                                                    'Refused',
                                                    "Don't know"]}

country_of_birth_table = {primary_key_name: [1, 3, 777777, 999999],
                          'description': ['Born in the US',
                                      'Born outside the US',
                                      'Refused',
                                      "Don't know"]}

citizenship_status_table = {primary_key_name: [1, 2, 777777, 999999],
                            'description': ['US Citizen',
                                       'Not a US citizen',
                                       'Refused',
                                       "Don't know"]}

education_level_children_table = {primary_key_name: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15,
                                                                777777, 999999],
                                             'description': ['Never Attended/Kindergarten Only',
                                                                 '1st Grade',
                                                                 '2nd Grade',
                                                                 '3rd Grade',
                                                                 '4th Grade',
                                                                 '5th Grade',
                                                                 '6th Grade',
                                                                 '7th Grade',
                                                                 '8th Grade',
                                                                 '9th Grade',
                                                                 '10th Grade',
                                                                 '11th Grade',
                                                                 '12th Grade, No Diploma',
                                                                 'High School Graduate',
                                                                 'GED or Equivalent',
                                                                 'More than high school',
                                                                 'Refused',
                                                                 "Don't know"]}

education_level_adults_table = {primary_key_name: [1, 2, 3, 777777, 999999],
                                   'description': ['Less than high school degree',
                                                       'High school grad/GED or some college/AA degree',
                                                       'College graduate or above',
                                                       'Refused',
                                                       "Don't know"]}

marital_status_table = {primary_key_name: [1, 2, 3, 777777, 999999],
                        'description': ['Married/Living with partner',
                                           'Widowed/Divorced/Separated',
                                           'Never married',
                                           'Refused',
                                           "Don't know"]}

total_number_of_people_table = {primary_key_name: [1, 2, 3, 4, 5, 6, 7],
                                'description': ['1 person',
                                                     '2 people',
                                                     '3 people',
                                                     '4 people',
                                                     '5 people',
                                                     '6 people',
                                                     '7 people or more']}

annual_income_table = {primary_key_name: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 14, 15, 777777, 999999],
                       'description': ['$0 to $4,999',
                                  '$5,000 to $9,999',
                                  '$10,000 to $14,999',
                                  '$15,000 to $19,999',
                                  '$20,000 to $24,999',
                                  '$25,000 to $34,999',
                                  '$35,000 to $44,999',
                                  '$45,000 to $54,999',
                                  '$55,000 to $64,999',
                                  '$65,000 to $74,999',
                                  '$75,000 to $99,999',
                                  '$100,000 and over',
                                  'Refused',
                                  "Don't know"]}

In [61]:
tables=[six_month_time_period_table,
       gender_table,
       age_groups_table,
       race_ethnic_origin_table,
       served_in_the_us_armed_forces_table,
       country_of_birth_table,
       citizenship_status_table,
       education_level_children_table,
       education_level_adults_table,
       marital_status_table,
       total_number_of_people_table,
       annual_income_table]
models=[m.six_month_time_period_table,
       m.gender_table,
       m.age_groups_table,
       m.race_ethnic_origin_table,
       m.served_in_the_us_armed_forces_table,
       m.country_of_birth_table,
       m.citizenship_status_table,
       m.education_level_children_table,
       m.education_level_adults_table,
       m.marital_status_table,
       m.total_number_of_people_table,
       m.annual_income_table]

In [89]:
for i in range(len(tables)):
    for j in range(len(tables[i]["id"])):
        id_code=tables[i]["id"][j]
        description_code=tables[i]["description"][j]
        newLine=models[i](id=id_code,description=description_code)
        db.session.add(newLine)

In [96]:
list=m.gender_table.query.all()
for line in list:
    print([line.id,line.description])

[1, 'Male']
[2, 'Female']

In [97]:
db.session.commit()

In [10]:
db.session

In [1]:
from sqlalchemy import create_engine,text

In [2]:
column="gender"
reference_table={}
reference_table[column]="gender_table"
with create_engine("sqlite:///../resources/nhanes.db").connect() as connection:
    query=f"""
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          AVG(money_spent_at_supermarket_grocery_store) as groceries,
          AVG(money_spent_on_nonfood_items) as non_food,
          AVG(money_spent_on_food_at_other_stores) as other_stores,
          AVG(money_spent_on_eating_out) as eating_out,
          AVG(money_spent_on_carryout_delivered_foods) as delivered,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10
    GROUP BY main.{column}
    """
    results=connection.execute(text(query))
for line in results:
    print(line)

(1, 'Male', 16826.541059449457, 19436.202130122714, 17654.82350219755, 28050.14735137636, 14249.260467268101, 4557)
(2, 'Female', 13287.528606686112, 17101.23394701392, 13811.43728965672, 24692.090868297062, 14925.545352492141, 4697)

In [3]:
column="gender"
reference_table={}
reference_table[column]="gender_table"
with create_engine("sqlite:///../resources/nhanes.db").connect() as connection:
    query=f"""
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'groceries' as response,
          AVG(money_spent_at_supermarket_grocery_store) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_at_supermarket_grocery_store<=8400 AND money_spent_at_supermarket_grocery_store IS NOT NULL
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'non_food' as response,
          AVG(money_spent_on_nonfood_items) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_nonfood_items<=8400 AND money_spent_on_nonfood_items IS NOT NULL
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'other_stores' as response,
          AVG(money_spent_on_food_at_other_stores) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_food_at_other_stores<=8400 AND money_spent_on_food_at_other_stores IS NOT NULL
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'eating_out' as response,
          AVG(money_spent_on_eating_out) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_eating_out<=8400 AND money_spent_on_eating_out IS NOT NULL
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'delivered' as response,
          AVG(money_spent_on_carryout_delivered_foods) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_carryout_delivered_foods<=8400 AND money_spent_on_carryout_delivered_foods IS NOT NULL
    GROUP BY main.{column}
    """
    results=connection.execute(text(query))
for line in results:
    print(line)

(1, 'Male', 'delivered', 36.424882629107984, 4260)
(1, 'Male', 'eating_out', 167.94095238095238, 4200)
(1, 'Male', 'groceries', 461.9835294117647, 4250)
(1, 'Male', 'non_food', 39.5140562248996, 4233)
(1, 'Male', 'other_stores', 154.31252943947246, 4246)
(2, 'Female', 'delivered', 33.07772965580123, 4387)
(2, 'Female', 'eating_out', 165.49919484702093, 4347)
(2, 'Female', 'groceries', 454.8317417007731, 4398)
(2, 'Female', 'non_food', 38.61334552102377, 4376)
(2, 'Female', 'other_stores', 152.16109215017065, 4395)

In [4]:
with create_engine("sqlite:///../resources/nhanes.db").connect() as connection:
    query=f"""
    SELECT 
          AVG(COALESCE(money_spent_at_supermarket_grocery_store,0)) as avg_coalesce, 
          AVG(money_spent_at_supermarket_grocery_store) as avg,
          COUNT(COALESCE(money_spent_at_supermarket_grocery_store,0)) as count_coalesce,
          COUNT(money_spent_at_supermarket_grocery_store) as count,
          SUM(COALESCE(money_spent_at_supermarket_grocery_store,0)) as sum_coalesce,
          SUM(money_spent_at_supermarket_grocery_store) as sum
    FROM main_table main
    """
    results=connection.execute(text(query))
    keys=results.keys()
    result_dict={}
    for result in results:
        for key,value in zip(keys,result):
            print([key,value])
            result_dict[key]=value

['avg_coalesce', 15402.213575220327]
['avg', 15891.159736254387]
['count_coalesce', 19403]
['count', 18806]
['sum_coalesce', 298849150.0]
['sum', 298849150.0]

In [5]:
result_dict["sum"]/result_dict["count"]==result_dict["avg"]

True

In [6]:
result_dict["sum_coalesce"]/result_dict["count_coalesce"]==result_dict["avg_coalesce"]

True

In [7]:
column="gender"
reference_table={}
reference_table[column]="gender_table"
with create_engine("sqlite:///../resources/nhanes.db").connect() as connection:
    query=f"""
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'groceries' as response,
          AVG(money_spent_at_supermarket_grocery_store) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_at_supermarket_grocery_store<=8400
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'non_food' as response,
          AVG(money_spent_on_nonfood_items) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_nonfood_items<=8400
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'other_stores' as response,
          AVG(money_spent_on_food_at_other_stores) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_food_at_other_stores<=8400
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'eating_out' as response,
          AVG(money_spent_on_eating_out) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_eating_out<=8400
    GROUP BY main.{column}
    UNION
    SELECT 
          main.{column} as value_id,
          ref.description as desc,
          'delivered' as response,
          AVG(money_spent_on_carryout_delivered_foods) as value,
          COUNT(*) as count
    FROM main_table main
    INNER JOIN {reference_table[column]} ref
    ON main.{column}=ref.id
    WHERE main.data_release_cycle = 10 AND money_spent_on_carryout_delivered_foods<=8400
    GROUP BY main.{column}
    """
    results=connection.execute(text(query))
for line in results:
    print(line)

(1, 'Male', 'delivered', 36.424882629107984, 4260)
(1, 'Male', 'eating_out', 167.94095238095238, 4200)
(1, 'Male', 'groceries', 461.9835294117647, 4250)
(1, 'Male', 'non_food', 39.5140562248996, 4233)
(1, 'Male', 'other_stores', 154.31252943947246, 4246)
(2, 'Female', 'delivered', 33.07772965580123, 4387)
(2, 'Female', 'eating_out', 165.49919484702093, 4347)
(2, 'Female', 'groceries', 454.8317417007731, 4398)
(2, 'Female', 'non_food', 38.61334552102377, 4376)
(2, 'Female', 'other_stores', 152.16109215017065, 4395)

In [33]:
# connection.rollback()
connection=create_engine("sqlite:///../resources/nhanes.db").connect()

In [25]:
columns=["money_spent_at_supermarket_grocery_store",
 "money_spent_on_nonfood_items",
 "money_spent_on_food_at_other_stores",
 "money_spent_on_eating_out",
 "money_spent_on_carryout_delivered_foods"]

In [26]:
# for col in columns:
#     query=f"""
#     UPDATE main_table
#     SET {col} = NULL
#     WHERE {col}>8400;
#     """
#     results=connection.execute(text(query))

In [34]:
query=f"""
SELECT 
      main.{column} as value_id,
      ref.description as desc,
      AVG(money_spent_at_supermarket_grocery_store) as groceries,
      COUNT(money_spent_at_supermarket_grocery_store) as groceries_count,
      AVG(money_spent_on_nonfood_items) as non_food,
      COUNT(money_spent_on_nonfood_items) as non_food_count,
      AVG(money_spent_on_food_at_other_stores) as other_stores,
      COUNT(money_spent_on_food_at_other_stores) as other_stores_count,
      AVG(money_spent_on_eating_out) as eating_out,
      COUNT(money_spent_on_eating_out) as eating_out_count,
      AVG(money_spent_on_carryout_delivered_foods) as delivered,
      COUNT(money_spent_on_carryout_delivered_foods) as delivered_count,
      COUNT(*) as count
FROM main_table main
INNER JOIN {reference_table[column]} ref
ON main.{column}=ref.id
WHERE main.data_release_cycle = 10
GROUP BY main.{column}
"""
results=connection.execute(text(query))
keys=results.keys()
for line in results:
    for key,value in zip(keys,line):
        print(key,value)

value_id 1
desc Male
groceries 461.9835294117647
groceries_count 4250
non_food 39.5140562248996
non_food_count 4233
other_stores 154.31252943947246
other_stores_count 4246
eating_out 167.94095238095238
eating_out_count 4200
delivered 36.424882629107984
delivered_count 4260
count 4557
value_id 2
desc Female
groceries 454.8317417007731
groceries_count 4398
non_food 38.61334552102377
non_food_count 4376
other_stores 152.16109215017065
other_stores_count 4395
eating_out 165.49919484702093
eating_out_count 4347
delivered 33.07772965580123
delivered_count 4387
count 4697

In [32]:
connection.commit()